1. In the data given below,
  - find the boolean mask where value is nan
  - remove the row with missing data.

In [33]:
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
df["F"]=s1
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1
#please provide your answer below this line
d = df1.isnull()
print(d)
dd = df1.dropna(how='any')
# dd = df1.dropna(how='all', subset=['F','E']) 
dd

                A      B      C      D     F      E
2021-01-01  False  False  False  False  True  False
2021-01-02  False  False  False  False  True  False
2021-01-03  False  False  False  False  True   True
2021-01-04  False  False  False  False  True   True

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

2. In the data given below,fill the missing data with 20.

In [38]:
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
df["F"]=s1
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
#please provide your answer below this line
df1.replace(to_replace = np.nan, value = 20)

                   A         B         C         D     F     E
2021-01-01 -0.496360 -0.411925 -1.197099 -0.191285  20.0   1.0
2021-01-02  0.271759  0.486278 -1.656563  0.347122  20.0   1.0
2021-01-03 -0.240611 -2.744937 -0.672132 -1.601012  20.0  20.0
2021-01-04 -0.796004 -0.183902  0.949686 -0.372417  20.0  20.0

3. From the data given below,
  - break the data in to pieces from 0 t0 2 ,3 t0 7
  - concatenate the pieces.
  - concatenate the pieces along axis 1
  - label each as 'a' and 'b' respectively and perform concatenation.

In [55]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4))
df
#please provide your answer below this line
s1 = df.iloc[:3]
s2 = df.iloc[3:8]


# concat 
d = pd.concat([s1,s2], axis=1)
d

          0         1         2  ...         1         2         3
0  0.154004  0.445463 -0.600500  ...       NaN       NaN       NaN
1  0.264669 -1.451382 -0.365411  ...       NaN       NaN       NaN
2  0.562821  0.389599 -2.217250  ...       NaN       NaN       NaN
3       NaN       NaN       NaN  ...  1.729933 -1.253135 -0.465748
4       NaN       NaN       NaN  ...  0.419990 -0.434255  1.166588
5       NaN       NaN       NaN  ...  2.133357 -0.286055  0.107244
6       NaN       NaN       NaN  ... -0.824673 -0.387798 -0.901082
7       NaN       NaN       NaN  ...  0.055676 -1.347395  0.262171

[8 rows x 8 columns]